<a href="https://colab.research.google.com/github/mharshavardhan224/DataAnalyst/blob/main/DEFAULT_DATA_SET.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

# Sample dataset with null values
data = {
    'Name': ['Harsha', 'Mouli', 'Sai', 'Krishna', 'Teja','shannu','jayaraju','vishnu','jnane','IPLsai','Monoj',],
    'Age': [21, None, 20, 22, 25, None, None, 10, None, 33, 34,],
    'Salary': [7500, 7500, None, 7500, 7500, 15000, None,15000,45000,None,30000,],
    'Department': ['HR', 'IT', 'IT', None, 'Finance','TL','Editing',None,'Editing','IT','Finance',],
}

df = pd.DataFrame(data)
print("Original Dataset:\n", df)
print(df)

Original Dataset:
         Name   Age   Salary Department
0     Harsha  21.0   7500.0         HR
1      Mouli   NaN   7500.0         IT
2        Sai  20.0      NaN         IT
3    Krishna  22.0   7500.0       None
4       Teja  25.0   7500.0    Finance
5     shannu   NaN  15000.0         TL
6   jayaraju   NaN      NaN    Editing
7     vishnu  10.0  15000.0       None
8      jnane   NaN  45000.0    Editing
9     IPLsai  33.0      NaN         IT
10     Monoj  34.0  30000.0    Finance
        Name   Age   Salary Department
0     Harsha  21.0   7500.0         HR
1      Mouli   NaN   7500.0         IT
2        Sai  20.0      NaN         IT
3    Krishna  22.0   7500.0       None
4       Teja  25.0   7500.0    Finance
5     shannu   NaN  15000.0         TL
6   jayaraju   NaN      NaN    Editing
7     vishnu  10.0  15000.0       None
8      jnane   NaN  45000.0    Editing
9     IPLsai  33.0      NaN         IT
10     Monoj  34.0  30000.0    Finance

In [ ]:
df.isnull().sum()

Name          0
Age           4
Salary        3
Department    2
dtype: int64

MEAN()

In [ ]:
df['Age'].fillna(df['Age'].mean(), inplace=True)
print("\nDataset after replacing null values:\n", df)
print(df.isnull().sum())

Dataset after replacing null values:
         Name        Age   Salary Department
0     Harsha  21.000000   7500.0         HR
1      Mouli  23.571429   7500.0         IT
2        Sai  20.000000  11250.0         IT
3    Krishna  22.000000   7500.0         IT
4       Teja  25.000000   7500.0    Finance
5     shannu  23.571429  15000.0         TL
6   jayaraju  23.571429  11250.0    Editing
7     vishnu  10.000000  15000.0         IT
8      jnane  23.571429  45000.0    Editing
9     IPLsai  33.000000  11250.0         IT
10     Monoj  34.000000  30000.0    Finance
Name          0
Age           0
Salary        0
Department    0
dtype: int64

<ipython-input-13-4df438f333de>:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean(), inplace=True)

MEDIAN()

In [ ]:
df['Salary'].fillna(df['Salary'].median(), inplace=True)
print("\nDataset after replacing null values:\n", df)
print(df.isnull().sum())

Dataset after replacing null values:
         Name        Age   Salary Department
0     Harsha  21.000000   7500.0         HR
1      Mouli  23.571429   7500.0         IT
2        Sai  20.000000  11250.0         IT
3    Krishna  22.000000   7500.0         IT
4       Teja  25.000000   7500.0    Finance
5     shannu  23.571429  15000.0         TL
6   jayaraju  23.571429  11250.0    Editing
7     vishnu  10.000000  15000.0         IT
8      jnane  23.571429  45000.0    Editing
9     IPLsai  33.000000  11250.0         IT
10     Monoj  34.000000  30000.0    Finance
Name          0
Age           0
Salary        0
Department    0
dtype: int64

<ipython-input-10-81ff8decf173>:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(df['Salary'].median(), inplace=True)

MODE()

In [ ]:
df['Department'].fillna(df['Department'].mode()[0], inplace=True)
print("\nDataset after replacing null values:\n", df)
print(df.isnull().sum())

Dataset after replacing null values:
         Name        Age   Salary Department
0     Harsha  21.000000   7500.0         HR
1      Mouli  23.571429   7500.0         IT
2        Sai  20.000000  11250.0         IT
3    Krishna  22.000000   7500.0         IT
4       Teja  25.000000   7500.0    Finance
5     shannu  23.571429  15000.0         TL
6   jayaraju  23.571429  11250.0    Editing
7     vishnu  10.000000  15000.0         IT
8      jnane  23.571429  45000.0    Editing
9     IPLsai  33.000000  11250.0         IT
10     Monoj  34.000000  30000.0    Finance
Name          0
Age           0
Salary        0
Department    0
dtype: int64